<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>

	<title>Pourquoi Git est Meilleur Que X</title>
	
	<link rel="stylesheet" href="blueprint/screen.css" type="text/css" media="screen, projection">
	<link rel="stylesheet" href="blueprint/print.css" type="text/css" media="print">    
	<!--[if IE]><link rel="stylesheet" href="blueprint/ie.css" type="text/css" media="screen, projection"><![endif]-->

	<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.2.6/jquery.min.js"></script>
	
	<style type="text/css">
		.header h1 { font-size: 3.5em; color: #666; }
		img { margin-bottom: 10px; }
		.text, p { font-size: 1.2em; margin-bottom: 10px; text-align: justify;}
		.intro { color: #444; }
		ul li { margin-top: 10px; }
		.section h2 { padding-left: 5px; background-color: #eee; cursor: pointer;}
    .section h2 a { color: #333; text-decoration:none; display: block; }
		.section { margin-bottom: 20px; }
		.contents { padding: 0 10px; }
		.args { float:right; }
		.lang { padding: 3px; font-weight: bold;}
		.section .lang { font-size: 0.8em; padding: 2px; font-weight: normal;}
		.svn { color: hsl(260,57%,24%); background: hsl(260,57%,83%) }
		.perforce { color: hsl(0,57%,24%); background: hsl(0,57%,83%) }
		.bzr { color: hsl(60,57%,24%); background: hsl(60,57%,83%) }
		.hg { color: hsl(190,57%,24%); background: hsl(190,57%,83%) }
		.sweet { color: #363; background: #beb; }
		.compare { color: #663; background: #eeb; }
		.help pre { font-size: 12px; }
		.help td { vertical-align: top; }
		code { font-size: 90%; }
		.footer { text-align: center; color: #663; background-color: #eea; padding: 10px;}
		.footer a { color: #440; }
	</style>
	
</head>

<body>

	<div class="container">

			<br/>
			
	    <div class="span-24 header">
				<table width="100%">
					<tr><td>
        		<h1>Pourquoi Git est Meilleur Que X</h1>
					</td><td align="right">
						<div id="menu">
							<span class="lang hg">hg</span>
							<span class="lang bzr">bzr</span>
							<span class="lang svn">svn</span>
							<span class="lang perforce">perforce</span>
						</div>
						<img style="float: right" src="images/wherex.gif">
					</td></tr>
					</table>
	    </div>

	    <div class="span-24">
					<div class="text intro">
						Ce site existe car je passe beaucoup de temps derni&egrave;rement &agrave; d&eacute;fendre les Gitsters contre les attaques de *fanboys*, *bandwagonism* et les *koolaid-thirst*. Donc, voici pourquoi les gens passent &agrave; Git apr&egrave;s avoir utilis&eacute; X, et pourquoi vous devriez le faire aussi. Cliquez simplement sur une raison pour la voir enti&egrave;rement.
					</div>
	    </div>

			<br/>

	    <div class="span-24 section">
					<div class="args">
						<span class="lang hg">hg</span>
						<span class="lang bzr">bzr</span>
						<span class="lang svn">svn</span>
						<span class="lang perforce">perforce</span>
					</div>

	        <h2>
				<a name="cheap-local-branching" href="#cheap-local-branching">Gestion Rapide des Branches</a>
			</h2>
					<div class="contents">
						
						<div class="text">
							La fonctionnalit&eacute;s majeure qui met Git &agrave; part de tous les autres SCM 
							est le mod&egrave;le de gestion des branches. Il est cmpl&eacute;tement diff&eacute;rent 
							de tous les mod&egrave;les que je compare ici, la plupart recommandant que la 
							meilleure fa&ccedil;on de cr&eacute;er une branche est de cloner le dépôt dans un
							nouveau r&eacute;pertoire.
						</div>
						
						<div class="text">
							Git ne fonctionne pas comme &ccedil;a. Git vous permettra d&#x27;avoir de multiple branches locales 
							qui peuvent &ecirc;tre totalement ind&eacute;pendante les unes des autres, 
							et dont la cr&eacute;ation, la fusion (merge) ou la suppression ne prend que quelaues secondes.
						</div>
						
						
						<div class="text">
							Cela veut dire que vous pouvez faire ce genre de choses:
							<ul>
								<li>Cr&eacute;er une branche pour essayer une nouvelle id&eacute;e, committer quelques fois, 
									revenir &agrave; l&#x27;endroit o&ugrave; vous avez cr&eacute;&eacute; cette branche, appliquer un patch, 
									retourner l&agrave; o&ugrave; vous exp&eacute;rimentez et fusionnez le avec votre branche principale.
								</li>
								<li>Avoir une branche qui contient toujours ce qui va en production,
									une autre que vous fusionnez votre travail pour faire des test,
									et quelques autres plus petites pour le travail au jour le jour.
								</li>
								<li>Cr&eacute;er une nouvelle branche pour toutes les fonctionnalit&eacute;s que vous d&eacute;veloppez, 
									comme &ccedil;a vous pourrez aller et revenir facilement entre-elles, et effacer chaque branche 
									une foi que la fonctionnalit&eacute; sera incluse dans la branche principale.
								</li>
								<li>Cr&eacute;er une branche pour vos exp&eacute;rimentations, et si vous r&eacute;alisez que &ccedil;a ne 
									fonctionnera pas, il vous suffit de la supprimer pour abandonner le travail, 
									sans personne pour le voir (m&ecirc;me si vous poussez d&#x27;autres branches entre temps)
								</li>
							</ul>
						</div>
						
						<img src="images/branches.png">
						
						<div class="text">
							Important: quand vous poussez les modifications sur un d&eacute;p&ocirc;t distant, 
							vous n&acute;&ecirc;tes pas oblig&eacute;s de poussez toutes vos branches. Vous pouvez 
							partager les branches que vous d&eacute;sirez. Cela lib&egrave;re les gens pour exp&eacute;rimenter 
							avec des nouvelles id&eacute;es sans se soucier de savoir quand et comment ils devront 
							combiner cette id&eacute;e ou la partager avec les autres.
						</div>
						
						<div class="text">
							Vous pouvez trouvez comment faire certaines de ces pratiques avec les autres syst&egrave;mes, 
							mais le travail n&eacute;cessaire est bien plus difficile et peut amener &agrave; se tromper. Git rend 
							ces processus incroyablement simples et &ccedil;a change la mani&egrave;re de travailler pour la plupart des 
							d&eacute;veloppeurs qui les apprennent.
						</div>
						
						<!-- TODO : (short screencast showing the awesomeness of git branches) -->
						<!-- TODO : (show tweets somehow) -->

						<div class="tweets">
							<img alt='jamis twitter' width="300" src="http://twictur.es/i/1022811017.gif">
							<img alt='trevorturk twitter' width="300" src="http://twictur.es/i/1022886570.gif">
							<img alt='thillerson twitter' width="300" src="http://twictur.es/i/1022842917.gif">
							<img alt='boblmartens twitter' width="300" src="http://twictur.es/i/1022818467.gif">
							<img alt='mathie twitter' width="300" src="http://twictur.es/i/1022816942.gif">
						</div>
					</div>
	    </div>
				
	    <div class="span-24 section">
					<div class="args">
						<span class="lang svn">svn</span>
						<span class="lang perforce">perforce</span>
					</div>
	        <h2>
          <a name="everything-is-local" href="#everything-is-local">Tout est Local</a>
	        </h2>
					<div class="contents">	

						<div class="text">
							This is basically true of all the distributed SCMs, but in my
							experience even more so with Git.  There is very little outside
							of 'fetch', 'pull' and 'push' that communicates in any way with 
							anything other than your hard disk.
						</div>

						<div class="text">
							This not only makes most operations much faster than you may
              be used to, but it also allows you to work on stuff offline.
              That may not sound like a big deal, but I'm always amazed at
              how often I actually do work offline.  Being able to branch,
              merge, commit and browse history of your project while on 
              the plane or train is very productive.
						</div>
						
						<center><img width="500px" src="images/local-remote.png"></center>

						<div class="text">
							Even in Mercurial, common commands like 'incoming' and 'outgoing' hit 
							the server, where with Git you can 'fetch' all the servers data
							before going offline and do comparisons, merges and logs of data
							that is on the server but not in your local branches yet.
						</div>
												
						<div class="text">
							This means that it's very easy to have copies of not only your
							branches, but also of everyones branches that are working with
							you in your Git repository without having to mess your own stuff
							up.
						</div>
						
					</div>
	    </div>
		
		  <div class="span-24 section">
					<div class="args">
						<span class="lang bzr">bzr</span>
						<span class="lang svn">svn</span>
						<span class="lang perforce">perforce</span>
					</div>
			
	        <h2>
          <a name="git-is-fast" href="#git-is-fast">Git est rapide</a>
	        </h2>

					<div class="contents">
						<div class="text">
							Git is fast.  Everyone, even most of the hard core users of these
							other systems generally give Git this title.  Compared to SVN and
							Perforce this is somewhat because all operations are done locally.
							However, even compared to the other DSCMs, Git it pretty fast. 
						</div>
					
						<div class="text">
							Part of this is likely because it was built to work on the Linux 
							kernel, which means that it has had to deal effectively with large
							repositories from day one.
							Another reason is that Git is written in C, and yet another reason
							is that the primary developers are, in my experience, very very 
							preoccupied with this.
						</div>

						<div class="text">
							The following are a number of benchmarks that I performed on three
							copies of the Django source code repository in 3 different SCMs:
							Git, Mercurial and Bazaar.  I also tested some of this stuff in SVN,
							but trust me, it's slower - basically take the Bazaar numbers and
							then add network latency...
						</div>
						
						<table>
						<tr><td nowrap>
							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:2,5,60&chds=0,60&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Init">

							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:85,3,23&chds=0,100&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Add">

							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:45,194,1474&chds=0,1474&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Status">
						
							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:5,21,142&chds=0,142&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Diff">
						</td><td rowspan="2">
							<img src="http://chart.apis.google.com/chart?cht=bvg&chs=190x275&chd=t:1,123,390|11,946,820&chds=0,1210&chxt=x&chco=4d89f9,c6d9fd&chl=git|hg|bzr&chtt=Branching">
						</td></tr>
						<tr><td nowrap>
							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:5,120,189&chds=0,230&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Tag">

							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:7,26,90&chds=0,90&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Log">

							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:124,125,230&chds=0,230&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Commit (Lg)">

							<img src="http://chart.apis.google.com/chart?cht=bvs&chs=100x125&chd=t:8,51,113&chds=0,113&chxt=x&chco=4d89f9&chl=git|hg|bzr&chtt=Commit (Sm)">
						</td></tr>
						</table>
						
						<div class="text">
							The end result was that for everything but adding new files, Git
							was fastest. (Also really large commits, which Hg was basically the
							same at, but the commit I tested was so large that you're unlikely
							to ever do anything like it - normal commits are much faster in Git)
						</div>
						
						<table>
							<tr>
								<th></th>
								<th>Git</th>
								<th>Hg</th>
								<th>Bzr</th>
							</tr>
							<tr>
								<th>Init</th>
								<td class="sweet">0.024s</td>
								<td>0.059s</td>
								<td>0.600s</td>
							</tr>
							<tr>
								<th>Add</th>
								<td>8.535s</td>
								<td class="sweet">0.368s</td>
								<td>2.381s</td>
							</tr>
							<tr>
								<th>Status</th>
								<td class="sweet">0.451s</td>
								<td>1.946s</td>
								<td>14.744s</td>
							</tr>
							<tr>
								<th>Diff</th>
								<td class="sweet">0.543s</td>
								<td>2.189s</td>
								<td>14.248s</td>
							</tr>
							<tr>
								<th>Tag</th>
								<td class="sweet">0.056s</td>
								<td>1.201s</td>
								<td>1.892s</td>
							</tr>
							<tr>
								<th>Log</th>
								<td class="sweet">0.711s</td>
								<td>2.650s</td>
								<td>9.055s</td>
							</tr>
							<tr>
								<th>Commit (Large)</th>
								<td class="sweet">12.480s</td>
								<td>12.500s</td>
								<td>23.002s</td>
							</tr>
							<tr>
								<th>Commit (Small)</th>
								<td class="sweet">0.086s</td>
								<td>0.517s</td>
								<td>1.139s</td>
							</tr>
							<tr>
								<th>Branch (Cold)</th>
								<td class="sweet">1.161s</td>
								<td>94.681s</td>
								<td>82.249s</td>
							</tr>
							<tr>
								<th>Branch (Hot)</th>
								<td class="sweet">0.070s</td>
								<td>12.300s</td>
								<td>39.411s</td>
							</tr>
						</table>
					
						<div class="text">
							The cold and hot branching numbers are the numbers for the first
							and second times that I branched a repo - the second number being
							a branch with a hot disk cache.
						</div>

						<div class="text">
							It should be noted that although the 'add' numbers are much slower,
              this was for a massive add operation - over 2000 files.  For the
              majority of what most people do on a daily basis, add ops in any
              of these systems will only take a fraction of a second. All of the
              other ops tested here (except for the large commit, possibly) are
              more indicitive of things you might actually do day to day.
						</div>
					
					
					<div class="text">
						These numbers are really not difficult to recreate, simply clone the Django
						project in each of the systems and try out the same commands in each.
						<ul>
							<li><code>git clone git://GitHub.com/brosner/django.git dj-git</code></li>
							<li><code>hg clone http://hg.dpaste.com/django/trunk dj-hg</code></li>
							<li><code>bzr branch lp:django dj-bzr</code></li>
							<li><code>svn checkout http://code.djangoproject.com/svn/django/trunk dj-svn</code></li>
						</ul>
					</div>
					
				</div>
					
					
	    </div>
	
		  <div class="span-24 section">
					<div class="args">
						<span class="lang svn">svn</span>
					</div>
			
	        <h2>
          <a name="git-is-small" href="#git-is-small">Git est L&eacute;ger</a>
	        </h2>
	
					<div class="contents">
						<div class="text">
							Git is really good at conserving space.  Your Git directory will 
							(in general) barely be larger than an SVN checkout - in some cases
							actually smaller (apparently a lot can go in those .svn dirs).
						</div>
					
						<div class="text">
							The following numbers were taken from clones of the Django project
							in each of its semi-official Git mirrors at the same point in 
							its history.
						</div>
					
						<table>
							<tr>
								<th></th>
								<th>Git</th>
								<th>Hg</th>
								<th>Bzr</th>
								<th>Bzr*</th>
								<th>SVN</th>
							</tr>
							<tr>
								<td>Repo Alone</td>
								<td class="sweet">24M</td>
								<td>34M</td>
								<td>45M</td>
								<td>89M</td>
								<td></td>
							</tr>
							<tr>
								<td>Entire Directory</td>
								<td class="compare">43M</td>
								<td>53M</td>
								<td>64M</td>
								<td>108M</td>
								<td class="compare">61M</td>
							</tr>
						</table>
						
						<div class="text"><small>
							* the second Bzr number is after I ran 'bzr pack', which I thought
							would make it smaller, but ended up making it much, much larger for
							some reason. 
						</small></div>
						
					</div>
	    </div>

	    <div class="span-24 section">
					<div class="args">
						<span class="lang hg">hg</span>
						<span class="lang bzr">bzr</span>
						<span class="lang svn">svn</span>
						<span class="lang perforce">perforce</span>
					</div>
		
	        <h2>
          <a name="the-staging-area" href="#the-staging-area">L&#x27;Aire d&#x27;Assemblage</a>
	        </h2>
	
					<div class="contents">
						<div class="text">
							A la diff&eacute;rence des autres syst&egrave;mes, Git propose ce qu&#x27;il appelle une &quot;Aire d&#x27;Assemblage&quot; 
							ou &quot;index&quot;. C&#x27;est une zone interm&eacute;diaire o&ugrave; vous pouvez configurer votre commit avant de 
							l&#x27;effectuer.
						</div>
						<div class="text">
							La chose la plus cool gr&acirc;ce &agrave; cette zone, et ce qui fait que Git est &agrave; part des autres 
							outils, est que vous pouvez facilement assembler certains de vos fichiers en les terminant 
							et puis les commiter sans toucher aux autres fichiers modifi&eacute;s de votre r&eacute;pertoire de travail, 
							ni les lister dans la ligne de commande durant le commit.
						</div>
						<center><img src="images/index1.png"></center>
						
						<div class="text">
							Cela permet aussi d&#x27;assembler certaines parties des fichiers modifi&eacute;s,
							par exemple en assemblant seulement les changements au d&eacute;but du fichier que vous &ecirc;tes en 
							train de coder, mais sans les changements en bas de ce fichier.
						</div>

						<div class="text">
							Bien sur, Git permet aussi d&#x27;ignorer assez facilement cette fonctionnalit&eacute; si vous ne voulez pas 
							de ce genre de contr&ocirc;le - ajoutez juste un &#x27;-a&#x27; &agrave; votre commande de commit.
						</div>
						
						<center><img src="images/index2.png"></center>
					</div>
	    </div>

	    <div class="span-24 section">
					<div class="args">
						<span class="lang svn">svn</span>
						<span class="lang perforce">perforce</span>
					</div>

	        <h2>
          <a name="distributed" href="#distributed">Distribu&eacute;</a>
	        </h2>

					<div class="contents">
						<div class="text">
							Une des fonctions les plus cool de n&#x27;importe quel SCM distribu&eacute;, 
							Git inclus, est qu&#x27;il est distribu&eacute;. Cela veut dire qu&#x27;au lieu 
							de faire un &quot;checkout&quot; sur la derni&egrave;re version du code, vous pouvez cloner 
							l&#x27;int&eacute;gralit&eacute; du d&eacute;p&ocirc;t.
            		  	</div>
            			
						<div class="text">
							Cela veut dire que m&ecirc;me si vous utilisez un workflow centralis&eacute;, 
							chaque utilisateur est essentiellement une sauvegarde compl&egrave;te du 
							serveur central, chacun pouvant servir &agrave; remplacer ce serveur central 
							en cas de crash ou de corruption. En simplifiant, il n&#x27;y a fondamentalement 
							pas de point de d&eacute;faillance unique avec Git, &agrave; moins que vous n&#x27;ayez 
							qu&#x27;une copie de votre d&eacute;p&ocirc;t.
            			</div>

            			<div class="text">
							Cela n&#x27;affecte en rien les performances. En moyenne, un checkout SVN est plus rapide 
							que n&#x27;importe quel DSCM, mas sans grande diff&eacute;rence. De plus, concernant les DSCM, Git 
							&eacute;tait le plus rapide durant mes tests.
					  	</div>

						<table>
							<tr><td>
								<img src="http://chart.apis.google.com/chart?cht=bvs&chs=200x150&chd=t:120,144,311,64&chds=0,320&chco=4d89f9&chl=git|hg|bzr|svn&chtt=Clone">
							</td><td width="80%">
								<table>
									<tr>
										<th>Git</th>
										<td class="sweet">1m 59s</td>
									</tr>
									<tr>
										<th>Hg</th>
										<td>2m 24s</td>
									</tr>
									<tr>
										<th>Bzr</th>
										<td>5m 11s</td>
									</tr>
									<tr>
										<th>SVN</th>
										<td>1m 4s</td>
									</tr>
								</table>
							</td></tr>
						</table>
						
					</div>
	    </div>
	
	
	    <div class="span-24 section">
				<div class="args">
					<span class="lang svn">svn</span>
					<span class="lang perforce">perforce</span>
				</div>
		
       	<h2>
        <a name="any-workflow" href="#any-workflow">Workflow Adapt&eacute;</a>
       	</h2>

				<div class="contents">
					
					<div class="text">
						Une des choses incroyables avec Git, gr&acirc;ce &agrave; sa nature distribu&eacute;e 
						et &agrave; sa superbe gestion des branches,  est que vous pouvez facilement 
						utiliser le type de workflow qui vous semble le plus naturel.
					</div>
					
					<h3>Workflow du Style Subversion</h3>
					

					<div class="text">
						Il est tr&egrave;s commun d&#x27;utiliser un workflow centralis&eacute; avec Git, 
						surtout pour les personnes venant juste de migrer depuis un 
						syst&egrave;me centralis&eacute;. Git ne vous permettra pas de pousser un commit 
						si quelqu&#x27;un a modifi&eacute; quelque chose depuis votre derni&egrave;re mise &agrave; jour, 
						ce mod&egrave;le centralis&eacute; o&ugrave; tous les d&eacute;veloppeurs poussent sur le m&ecirc;me serveur 
						fonctionne tr&egrave;s bien.
					</div>
					
					<center><img src="images/workflow-a.png"></center><br/>
					
					<h3>Workflow g&eacute;rer par un Manager d&#x27;Int&eacute;gration</h3>

					<div class="text">
						Un autre workflow commun &agrave; Git consiste &agrave; d&eacute;signer un manager d&#x27;int&eacute;gration - une seule 
						personne peut faire les commits sur le &#x27;Saint-d&eacute;p&ocirc;t&#x27;. Le reste des d&eacute;veloppeurs clone ce 
						d&eacute;p&ocirc;t pour cr&eacute;er des d&eacute;p&ocirc;ts ind&eacute;pendants sur lesquels ils pourront faire leurs commits, pour
						ensuite demander au manager de r&eacute;cup&eacute;rer leurs changements. C&#x27;est le mod&egrave;le de d&eacute;veloppement
						que vous verrez souvent avec les d&eacute;p&ocirc;ts open source ou sur GitHub.
					</div>

					<center><img src="images/workflow-b.png"></center><br/>

					<h3>Workflow du Dictateur et ses Lieutenants</h3>

					<div class="text">
						Pour les projets de grande taille, vous pouvez organisez vos d&eacute;veloppeurs &agrave; la fa&ccedil;on 
						du kernel Linux, o&ugrave; certaines personnes sont en charge d&#x27;un sous-syst&egrave;me sp&eacute;cifique
						du projet (&#x27;lieutenant&#x27;) et elles combinent tous les changements de leur sous-syst&egrave;me. 
						Puis, un autre int&eacute;grateur (&#x27;dictateur&#x27;) peut r&eacute;cup&eacute;rer seulement les changements de 
						ses lieutenants, et pousser ces modifications sur le &#x27;Saint-d&eacute;p&ocirc;t&#x27;, que tout le monde 
						peut cloner &agrave; nouveau.
					</div>

					<center><img src="images/workflow-c.png"></center><br/>
					
					<div class="text">
						Une fois encore, Git est enti&egrave;rement flexible avec les workflow, vous pouvez donc m&eacute;langer, reproduire 
						et choisir le workflow qui vous convient.
          			</div>


				</div>
	    </div>
	
	
	    <div class="span-24 section">
				<div class="args">
					<span class="lang hg">hg</span>
					<span class="lang bzr">bzr</span>
					<span class="lang svn">svn</span>
					<span class="lang perforce">perforce</span>
				</div>

        <h2>
        <a name="GitHub" href="#GitHub">GitHub</a>
        </h2>
				
				<div class="contents">

          <img style="float:right; padding:10px" src="images/octocat.png">

					<div class="text">
						GitHub est &agrave; l&#x27;origine du choix de Git pour beaucoup de gens.
					</div>

					<div class="text">
						GitHub est &agrave; l&#x27;origine du choix de Git pour beaucoup de gens car c&#x27;est plus 
						comme un r&eacute;seau social pour du code qu&#x27;un simple h&eacute;bergeur. Le site permet de trouver 
						d&#x27;autres d&eacute;veloppeur ou des projets qui sont similaires aux choses que vous faites, et 
						auxquels vous pouvez facilement forker ou contribuer, en cr&eacute;ant une communaut&eacute; vibrante autour
						de Git et des projets utilis&eacute;s avec Git.
						for.
					</div>
					
					<div class="text">
						Il y a d&#x27;autres services, pour Git ou d&#x27;autres SCM, mais peu sont tourn&eacute;s vers l&#x27;utilisateur ou 
						l&#x27;usage des r&eacute;seaux sociaux, et aucun n&#x27;arrive &agrave; regrouper autant de monde. L&#x27;aspect social de GitHub 
						est fantastique, et cela, en plus toutes les autres fonctionnalit&eacute;s pr&eacute;c&eacute;dentes, fait de Git et GitHub 
						une superbe combinaison pour rapidement d&eacute;velopper des projets open source.
					</div>

					<div class="text">
						Ce type de communaut&eacute; n&#x27;existe simplement pas avec les autres SCM.
          			</div>
					
					<div class="tweets">
						<img alt='puls twitter' width="300" src="http://twictur.es/i/1022858126.gif">
						<img alt='twitter' width="300" src="http://twictur.es/i/1022857633.gif">
					</div>
				</div>
	    </div>
	
	
			<!-- 
				OTHER IDEAS:
				* easy merging
				* easy server setup
				* non destructive
			-->

	
			<!-- GIT MYTHS -->
	
	    <div class="span-24 section">
				<div class="args">
					<span class="lang perforce">perforce</span>
				</div>
				
        <h2>
        <a name="easy-to-learn" href="#easy-to-learn">Facile &agrave; Apprendre</a>
        </h2>

				<div class="contents">
					<div class="text">										
						This did not used to be true - early in Git's life, it was not really 
						an SCM so much as a bunch of tools that let you do versioned filesystem 
						work in a distributed manner.  However, today, the command set and 
						learning curve of Git are pretty similar to any other SCM, and even 
						better than some.
					</div>

					<div class="text">										
						Since this is difficult to prove objectively without some sort of 
						study, I'll just show the difference between the default 'help' menu for the
						Mercurial and Git commands.  I've highlighted the commands that are
						identical (or nearly) between the two systems.  (In Hg, if you type 'hg help', you 
						get a list of 40-some commands.)
					</div>
				
					<table class="help">
						<tr><td valign="top">
							
<h3>Aide Mercurial</h3>
<pre>
<span class="compare">add</span>        add the specified files ...
<span class="compare">annotate</span>   show changeset informati...
<span class="compare">clone</span>      make a copy of an existi...
<span class="compare">commit</span>     commit the specified fil...
<span class="compare">diff</span>       diff repository (or sele...
export     dump the header and diff...
<span class="compare">init</span>       create a new repository ...
<span class="compare">log</span>        show revision history of...
<span class="compare">merge</span>      merge working directory ...
parents    show the parents of the ...
<span class="compare">pull</span>       pull changes from the sp...
<span class="compare">push</span>       push changes to the spec...
<span class="compare">remove</span>     remove the specified fil...
serve      export the repository vi...
<span class="compare">status</span>     show changed files in th...
update     update working directory
</pre>

					</td><td valign="top">
						
<h3>Aide Git</h3>
<pre>
<span class="compare">add</span>        Add file contents to the index
<span class="compare">bisect</span>     Find the change that introduce...
<span class="compare">branch</span>     List, create, or delete branches
checkout   Checkout a branch or paths to ...
<span class="compare">clone</span>      Clone a repository into a new ...
<span class="compare">commit</span>     Record changes to the repository
<span class="compare">diff</span>       Show changes between commits, ...
fetch      Download objects and refs from...
grep       Print lines matching a pattern
<span class="compare">init</span>       Create an empty git repository
<span class="compare">log</span>        Show commit logs
<span class="compare">merge</span>      Join two or more development h...
mv         Move or rename a file, a direc...
<span class="compare">pull</span>       Fetch from and merge with anot...
<span class="compare">push</span>       Update remote refs along with ...
rebase     Forward-port local commits to ...
reset      Reset current HEAD to the spec...
<span class="compare">rm</span>         Remove files from the working ...
show       Show various types of objects
<span class="compare">status</span>     Show the working tree status
<span class="compare">tag</span>        Create, list, delete or verify...
</pre>	
				</td></tr>
				</table>
				
				<div class="text">										
					Prior to Git 1.6, all of the Git commands used to be in the executable
					path, which was very confusing to people.  Although Git still recognizes
					all of those commands, the only command in the path is now 'git'.
					So, if you look at Mercurial and Git, Git has a nearly identical 
					command set and help system - there is very little difference from 
					a beginning UI perspective today.
				</div>
				
				<div class="text">										
					These days it's pretty hard to argue that Mercurial or Bazaar is any
					easier to learn than Git is.
				</div>
				
				</div>
				
	    </div>
	
	
		<!-- 
			THINGS GIT IS STILL NOT GOOD AT 
			* windows (all)
			* large files (svn)
		-->

		<br/>
		
    <div class="span-24 footer">
		Ce site est construit et maintenu par <a href="http://GitHub.com/alx">Alexandre Girard</a>, un <a href="http://GitHub.com">GitHubber</a>.<br/>
		Si vous n&#x27;&ecirc;tes pas d&#x27;accord avec certaines informations de ce site, et que vous avez de bonnes raisons, merci de <a href="mailto:alex.girard@gmail.com">m'envoyer un mail</a> pour que je puisse corriger ces erreurs.<br/>
		Le code de ce site est disponible <a href="http://GitHub.com/alx/whygitisbetter">sur GitHub</a> - n&#x27;h&eacute;sitez pas &agrave; envoyer vos patches si vous voulez l&#x27;am&eacute;liorer.
		</div>

	</div>

<script>
	$(function() {
		$('.section > .contents').hide();
		$('.contents > .tweets').hide();
		$('.section > h2').click(function() {
			$(this).next().slideToggle();
		})
		
		if (document.location.hash) {
		  $('.section > h2 > a[name=' + document.location.hash.substring(1) + ']').parent('h2').click()
		}
	})
</script>

<script type="text/javascript">
var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www.");
document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));
</script>
<script type="text/javascript">
try {
var pageTracker = _gat._getTracker("UA-82337-13");
pageTracker._trackPageview();
} catch(err) {}</script>

</body>
</html>

